Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: res/: Contains resources that aren't compiled into resources.arsc.
zh_cn: res/：包含未编译到 resources.arsc 中的资源。

source: resources.arsc: Contains compiled resources.
zh_cn: resources.arsc：包含已编译的资源。

source: subset must be contained within the size set by setTargetSize(int, int) or the bounds of the image if setTargetSize was not called.
zh_cn: subset 必须包含在 setTargetSize(int, int) 设置的大小内，如果未调用 setTargetSize，则必须包含在图像的边界内。

source: true to create and return a Drawable or Bitmap with partial data.
zh_cn: true 创建并返回带有部分数据的 Drawable 或 Bitmap。

source: onMeasure() is a critical piece of the rendering contract between your component and its container.
zh_cn: onMeasure() 是组件和它的容器之间相关联的渲染的一个关键部分。

source: FAB_ALIGNMENT_MODE_CENTER mode is the primary mode with the FAB is centered.
zh_cn: FAB_ALIGNMENT_MODE_CENTER 模式是 FAB 居中的主要模式。

source: ValueAnimator changes the rotation over a period of several hundred milliseconds, rather than immediately setting the new rotation value.
zh_cn: ValueAnimator 会在几百毫秒的时间内更改旋转，而不是立即设置新的旋转值。

source: materialButtonOutlinedStyle will most closely match the Material Design guidelines for this component, and supports the checked state for child buttons.
zh_cn: materialButtonOutlinedStyle 将最符合此组件的 Material Design 准则，并支持子按钮的已检查状态。

source: DiffUtil takes both lists as input and computes the difference, which can be passed to RecyclerView to trigger minimal animations and updates to keep your UI performant, and animations meaningful.
zh_cn: DiffUtil 将两个列表作为输入并计算差异，可以将其传递给 RecyclerView 以触发最小的动画和更新，以保持 UI 的性能和动画的有意义。

source: onMeasure() should be overridden to efficiently and accurately report the measurements of its contained parts.
zh_cn: onMeasure() 应该重写来有效而准确地报告它容纳的部分的测量结果。

source: AsyncListDiffer also provides this behavior, but without defining an Adapter to subclass.
zh_cn: AsyncListDiffer 也提供此行为，但未定义适配器到子类。

source: Canvas has a method to draw a rectangle, while Paint defines whether to fill that rectangle with a color or leave it empty.
zh_cn: Canvas 有一种绘制矩形的方法，而 Paint 定义是否用颜色填充该矩形或将它留空。

source: DrawerLayout.SimpleDrawerListener offers default/no-op implementations of each callback method.
zh_cn: DrawerLayout.SimpleDrawerListener 提供每个回调方法的默认/无操作实现。

source: ExtendedFloatingActionButton can be anchored to the BottomAppBar, but currently animations and the cutout are not supported.
zh_cn: ExtendedFloatingActionButton 可以锚定到 BottomAppBar，但目前不支持动画和剪裁。

source: FAB_ALIGNMENT_MODE_END is the secondary mode with the FAB on the side.
zh_cn: FAB_ALIGNMENT_MODE_END 是 FAB 在边上的第二种模式。

source: false (which is the default) to abort the decode and throw e.
zh_cn: false(这是默认值)中止解码并抛出 e。

source: computeScrollOffset() updates the Scroller object's internal state by reading the current time and using the physics model to calculate the x and y position at that time.
zh_cn: computeScrollOffset() 通过读取当前时间并使用物理模型来计算 Scroller 对象的内部状态那时的 x 和 y 位置。

source: buffer's contents should never be modified during decode.
zh_cn: 在解码过程中不应修改 buffer 的内容。

source: This class was deprecated in API level 17.
zh_cn: 此类在 API 级别 17 中已弃用。

source: This class was deprecated in API level 26.
zh_cn: 此类在 API 级别 26 中已弃用。

source: This class was deprecated in API level 29.
zh_cn: 此类已在 API 级别 29 中弃用。

source: This field was deprecated in API level 13.
zh_cn: 此字段在 API 级别 13 中已被弃用。

source: This interface is deprecated.
zh_cn: 不推荐使用此接口。

source: This interface was deprecated in API level 12.
zh_cn: 此接口在 API 级别 12 中已弃用。

source: This interface was deprecated in API level 28.
zh_cn: 此接口在 API 级别 28 中已被弃用。

source: Note: You cannot use the value wrap_content for the android:layout_height attribute of a ExpandableListView in XML if the parent's size is also not strictly specified (for example, if the parent were ScrollView you could not specify wrap_content since it also can be any length.
zh_cn: Note: 如果父级的 size 也没有严格指定的话，你不能将值 wrap_content 用于 XML 中 ExpandableListView 的 android:layout_height 属性(例如，如果父级是 ScrollView，则无法指定 wrap_content，因为它也可以是任何长度。

source: A branded logo image. This may extend to the height of the bar and can be arbitrarily wide.
zh_cn: 一个品牌 logo。 这可以延伸到栏的高度，并且可以任意宽。

source: A navigation button. This may be an Up arrow, navigation menu toggle, close, collapse, done or another glyph of the app's choosing.
zh_cn: 一个导航按钮。 这可能是应用程序选择的向上箭头，导航菜单切换，关闭，折叠，完成或其他字形。

source: A title and subtitle. The title should be a signpost for the Toolbar's current position in the navigation hierarchy and the content contained there.
zh_cn: 一个标题和子标题。 标题应该是工具栏在导航层次结构中当前位置的路标以及其中包含的内容。

source: Adapter: A subclass of RecyclerView.Adapter responsible for providing views that represent items in a data set.
zh_cn: Adapter: RecyclerView.Adapter 的子类，负责提供展示数据集中某条数据的 view。

source: An ActionMenuView. The menu of actions will pin to the end of the Toolbar offering a few frequent, important or typical actions along with an optional overflow menu for additional actions.
zh_cn: 一个 ActionMenuView。 操作菜单将固定到工具栏的末尾，提供一些 频繁，重要或典型的 操作以及可选的溢出菜单以执行其他操作。

source: An action menu. The menu of actions will pin to the end of the Toolbar offering a few frequent, important or typical actions along with an optional overflow menu for additional actions.
zh_cn: 一个 操作菜单。 操作菜单将固定到工具栏的末尾，提供一些 常用，重要或典型的 操作，以及一个可选的溢出菜单，提供其他操作。

source: Anytime somebody has an empty catch clause they should have a creepy feeling.
zh_cn: 无论何时，只要遇到空的 catch 子句，就应该保持警惕。

source: Binding: The process of preparing a child view to display data corresponding to a position within the adapter.
zh_cn: Binding: 准备一个 view（用于显示 adapter 中相应 position 的数据）的过程。 。

source: Dirty (view): A child view that must be rebound by the adapter before being displayed.
zh_cn: Dirty (view): 一个子 view，它在显示之前必须由 adapter 重新绑定。

source: Index: The index of an attached child view as used in a call to ViewGroup.getChildAt(int).
zh_cn: Index: 在调用 ViewGroup.getChildAt(int) 时使用的附加子 view 的索引。

source: Index: The index of an attached child view as used in a call to getChildAt(int).
zh_cn: Index: 已经附加的子 view 的索引，可用于调用 getChildAt(int) 时使用的参数。

source: Note: The entire view tree is single threaded.
zh_cn: 注意：整个 view 树是一个单一的线程。

source: Note: VideoView does not retain its full state when going into the background. In particular, it does not restore the current play state, play position, selected tracks, or any subtitle tracks added via addSubtitleSource().
zh_cn: 注意：进入后台时，VideoView 不会保持其完整状态。 特别是，它不会恢复当前播放状态，播放位置，选定曲目或通过 addSubtitleSource() 添加的任何字幕轨道。

source: One or more custom views. The application may add arbitrary child views to the Toolbar.
zh_cn: 一个或多个自定义 view。 应用程序可以向工具栏添加任意子 view。

source: Position: The position of a data item within an Adapter.
zh_cn: Position: 数据项在 Adapter 中的位置。

source: Recycle (view): A view previously used to display data for a specific adapter position may be placed in a cache for later reuse to display the same type of data again later.
zh_cn: Recycle (view): 一个 view 之前用于显示 adapter 中某个位置的数据，它可能会被放到缓存中，以便于之后再次使用用于显示相同类型的数据。

source: Scrap (view): A child view that has entered into a temporarily detached state during layout.
zh_cn: Scrap (view): 指在布局过程中，一个进入暂时分离状态的子 view。

source: How to draw, handled by Paint.
zh_cn: 如何 绘制，由 Paint 处理。

source: What to draw, handled by Canvas
zh_cn: 绘制什么，由 Canvas 处理

source: CONTRACT: When overriding this method, you must call setMeasuredDimension(int, int) to store the measured width and height of this view.
zh_cn: CONTRACT: 当重写该方法时，你 must 调用 setMeasuredDimension(int, int) 方法以保存该 view 的测量出的宽和高。

source: Do not manually add views to the Toolbar at run time.
zh_cn: 运行时不要手动将 view 添加到工具栏。

source: Figure 1. A visual representation of the important parts of a cold application launch.
zh_cn: Figure 1. 冷应用程序启动的重要部分的直观表示。

source: Figure 1. The editor shows view C below A, but it has no vertical constraint
zh_cn: Figure 1. 编辑器显示 A 下面的 view C，但没有垂直约束

source: Figure 11. The view is set to a 16:9 aspect with the width based on a ratio of the height.
zh_cn: Figure 11. view 设置为 16：9，宽度基于高度的比率。

source: Figure 12. The toolbar's Margin button.
zh_cn: Figure 12. 工具栏的 Margin 按钮。

source: Figure 13. A chain with just two views
zh_cn: Figure 13. 只有 2 个 view 的链

source: Figure 14. Examples of each chain style
zh_cn: Figure 14. 每个链样式的例子

source: Figure 2. Disabling filters, and finding the Displayed value in logcat.
zh_cn: Figure 2. 禁用过滤器，并在 logcat 中查找 Displayed 值。

source: Figure 2. View C is now vertically constrained below view A
zh_cn: Figure 2. view C 现在垂直限制在 view A 下方

source: Figure 4.
zh_cn: 图 4。

source: Figure 5. A horizontal and vertical constraint
zh_cn: Figure 5. 水平和垂直约束

source: Figure 6. A horizontal alignment constraint
zh_cn: Figure 6. 水平对齐的约束

source: Figure 7. An offset horizontal alignment constraint
zh_cn: Figure 7. 带偏移的水平对齐约束。

source: Figure 8. A baseline alignment constraint
zh_cn: Figure 8. 基线约束限制

source: Figure 9. A view constrained to a guideline
zh_cn: Figure 9. view 的参考线约束

source: Fixed: You specify a specific dimension in the text box below or by resizing the view in the editor.
zh_cn: Fixed：你可以在下面的文本框中指定特定的尺寸，也可以在编辑器中调整 view 大小。

source: Note: ProGuard can clean up some unnecessary code imported with a library, but it can't remove a library's large internal dependencies.
zh_cn: Note: ProGuard 可以清除一些用库导入的不必要的代码，但它无法移除库的大型内部依赖项。

source: Note: A bool is a simple resource that is referenced using the value provided in the name attribute (not the name of the XML file).
zh_cn: Note: bool 是一个简单的资源，使用 name 属性中提供的值(不是 XML 文件的名称)引用。

source: Note: A color is a simple resource that is referenced using the value provided in the name attribute (not the name of the XML file).
zh_cn: Note: 颜色是使用 name 属性(不是 XML 文件的名称)中提供的值引用的简单资源。

source: Note: A dimension is a simple resource that is referenced using the value provided in the name attribute (not the name of the XML file).
zh_cn: Note: 尺寸是使用 name 属性(不是 XML 文件的名称)中提供的值引用的简单资源。

source: Note: A typed array is a simple resource that is referenced using the value provided in the name attribute (not the name of the XML file).
zh_cn: Note: 类型化数组是使用 name 属性(而不是 XML 文件的名称)中提供的值引用的简单资源。

source: Note: Although the velocity calculated by GestureDetector is physically accurate, many developers feel that using this value makes the fling animation too fast.
zh_cn: Note: 虽然 GestureDetector 计算的速度在物理上是准确的，但许多开发人员认为使用此值会使投掷动画过快。

source: Note: An ID is a simple resource that is referenced using the value provided in the name attribute (not the name of the XML file).
zh_cn: Note: ID 是使用 name 属性中提供的值(不是 XML 文件的名称)引用的简单资源。

source: Note: An integer array is a simple resource that is referenced using the value provided in the name attribute (not the name of the XML file).
zh_cn: Note: 整数数组是使用 name 属性(不是 XML 文件的名称)中提供的值引用的简单资源。

source: Note: An integer is a simple resource that is referenced using the value provided in the name attribute (not the name of the XML file).
zh_cn: Note: 整数是使用 name 属性(不是 XML 文件的名称)中提供的值引用的简单资源。

source: Note: Avoid setting setClipToOutline(boolean) to true.
zh_cn: Note: 避免将 setClipToOutline(boolean) 设置为 true。

source: Note: Google Play accepts APKs only if the launcher icons use the PNG format.
zh_cn: Note: 仅当 launcher icons 使用 PNG 格式时，Google Play 才会接受 APK。

source: Note: In platform version 17 and lower, RelativeLayout was affected by a measurement bug that could cause child views to be measured with incorrect MeasureSpec values.
zh_cn: Note: 在平台版本 17 及更低版本中，RelativeLayout 受到测量错误的影响，该测量错误可能导致使用不正确的 MeasureSpec 值测量子 view。

source: Note: Starting in platform version Build.VERSION_CODES.N, SurfaceView's window position is updated synchronously with other View rendering.
zh_cn: Note: 从平台版本 Build.VERSION_CODES.N 开始，SurfaceView 的窗口位置与其他 view 渲染同步更新。

source: Note: The Intent.setClipData() method is only available in platform version 16 (Android 4.1) and later.
zh_cn: Note: Intent.setClipData() 方法仅在平台版本 16（Android 4.1）及更高版本中可用。

source: Note: The lint tool doesn't scan the assets/ folder, assets that are referenced via reflection, or library files that you've linked to your app.
zh_cn: Note: lint 工具不会扫描 assets/ 文件夹，通过反射引用的资源，或你链接到你的应用程序的库文件。

source: Note: The actual view hierarchy present under MaterialCardView is NOT guaranteed to match the view hierarchy as written in XML.
zh_cn: Note: MaterialCardView 下的实际 view 层次结构 不 保证与 XML 编写的 view 层次结构相匹配。

source: Note: The actual view hierarchy present under TextInputLayout is NOT guaranteed to match the view hierarchy as written in XML.
zh_cn: Note: TextInputLayout 下的实际 view 层次结构不保证与用 XML 编写的 view 层次结构相匹配。

source: Note: These rules are intended for the Android platform and are not required of Android app developers.
zh_cn: Note: 这些规则适用于 Android 平台，但并不强制要求 Android 应用程序开发人员遵守。

source: Note: This class is included in the support library for compatibility with API level 7 and higher.
zh_cn: Note: 此类包含在 support library 中，以便与 API 级别 7 及更高版本兼容。

source: Note: This does not apply to 3D graphics.
zh_cn: Note: 这不适用于 3D 图形。

source: Note: This flag is ignored when used with decodeResource(Resources, int, android.graphics.BitmapFactory.Options) or decodeFile(String, android.graphics.BitmapFactory.Options).
zh_cn: 注意：与 decodeResource(Resources, int, android.graphics.BitmapFactory.Options) 或 decodeFile(String, android.graphics.BitmapFactory.Options)一起使用时，该标志将被忽略。

source: Note: Use the setStartIconDrawable(Drawable) API in place of setting a start/left compound drawable on the EditText.
zh_cn: Note: 使用 setStartIconDrawable(Drawable) API 代替在 EditText 上设置 start/left 复合 drawable。

source: Note: When using an end icon, the 'end' compound drawable of the EditText will be overridden while the end icon view is visible.
zh_cn: Note: 使用结束图标时，当显示结束图标 view 时将覆盖 EditText 的 'end' 复合 drawable。

source: Note: You can use ValueAnimator in applications that target lower API levels.
zh_cn: Note: 你可以在目标较低 API 级别的应用程序中使用 ValueAnimator。

source: Note The original exception is passed to the constructor for RuntimeException.
zh_cn: Note 原始异常会传递到 RuntimeException 的构造函数。

source: Required. This must be the root node.
zh_cn: Required. 这必须是根节点。

source: Set focus: The framework will handle moving focus in response to user input.
zh_cn: Set focus: 框架将处理移动焦点以响应用户输入。

source: Set properties: for example setting the text of a TextView.
zh_cn: Set properties: 比如，设置 TextView 的文字。

source: Set up listeners: Views allow clients to set listeners that will be notified when something interesting happens to the view.
zh_cn: Set up listeners:view 允许调置监听器，当特定的事件发生时，view 将通知监听器。

source: Set visibility: You can hide or show views using setVisibility(int).
zh_cn: Set visibility: 你可以通过 setVisibility(int) 来隐藏或显示 view。

source: Tip: Extension classes can be defined as inner classes inside the activities that use them.
zh_cn: Tip: 继承类可以在使用它们的 Activity 中定义为内部类。

source: >> remove removed and invalid flags, add update flag to rebind because item was invisible to us and we don't know what happened in between.
zh_cn: >> 移除已移除和无效的标志，将更新标志添加到重新绑定，因为项目对我们不可见，我们不知道两者之间发生了什么。

source: A CardView whose width can be specified by the number of columns that it will span.
zh_cn: 一个 CardView，其宽度可以通过它将跨越的列数来指定。

source: A Gravity value describing how this child view dodges any inset child views in the CoordinatorLayout.
zh_cn: Gravity 值，用于描述此子 view 如何在 CoordinatorLayout 中躲过任何内插子 view。

source: A Gravity value describing how this child view insets the CoordinatorLayout.
zh_cn: Gravity 值，用于描述此子 view 如何对 CoordinatorLayout 进行插入。

source: A Gravity value describing how this child view should lay out.
zh_cn: Gravity 值，用于描述此子 view 的布局方式。

source: A Gravity value describing which edge of a child view's anchor view the child should position itself relative to.
zh_cn: Gravity 值描述子 view 应该相对于它的 anchor 的哪一边进行定位。

source: A NinePatchDrawable graphic is a stretchable bitmap image, which Android will automatically resize to accommodate the contents of the View in which you have placed it as the background.
zh_cn: NinePatchDrawable 图形是一个可伸缩的位图，如果你把它设置为背影，安卓将会自动缩放以适应 View 的内容。

source: A RecyclerView.LayoutManager implementations that lays out items in a grid.
zh_cn: 一个 RecyclerView.LayoutManager 的实现，它布局 item 在一个表格中。

source: A TabLayout.OnTabSelectedListener class which contains the necessary calls back to the provided ViewPager so that the tab position is kept in sync.
zh_cn: 一个 TabLayout.OnTabSelectedListener 类，其中包含必要的回调到提供的 ViewPager，以便保留选项卡位置同步。

source: A ViewGroup.LayoutParams implementation for AppBarLayout.
zh_cn: AppBarLayout 的 ViewGroup.LayoutParams 实现。

source: A ViewPager.OnPageChangeListener class which contains the necessary calls back to the provided TabLayout so that the tab position is kept in sync.
zh_cn: 一个 ViewPager.OnPageChangeListener 类，其中包含对所提供的 TabLayout 的必要调用，以便保留选项卡位置同步。

source: A ConstraintLayout is a ViewGroup which allows you to position and size widgets in a flexible way.
zh_cn: 【参考：代码咖啡.细细品读！深入浅出，官方文档看 ConstraintLayout.http://www.jianshu.com/p/38ee0aa654a8】ConstraintLayout 是一个 ViewGroup，它允许你以灵活的方式定位和设置小部件大小。

source: A ConstraintLayout is a android.view.ViewGroup which allows you to position and size widgets in a flexible way.
zh_cn: ConstraintLayout 是一个 android.view.ViewGroup，它允许你以灵活的方式定位和调整小部件的大小。

source: A LayoutManager is responsible for measuring and positioning item views within a RecyclerView as well as determining the policy for when to recycle item views that are no longer visible to the user.
zh_cn: LayoutManager 负责在 RecyclerView 中测量和定位 item views，同时决定当 item views 对用户不可见时的复用策略。

source: A Placeholder provides a virtual object which can position an existing object.
zh_cn: Placeholder 提供可以定位现有对象的虚拟对象。

source: A Source object can be reused to create multiple versions of the same image.
zh_cn: 可以重用 Source 对象来创建同一图像的多个版本。

source: A ViewGroup is a special view that can contain other views (called children.) The view group is the base class for layouts and views containers.
zh_cn: ViewGroup 是一个特殊 view，可以包含其他 view(称为子 view)。view group 是 layout 和 view 容器的基类。

source: A PostProcessor can also be a lambda:
zh_cn: PostProcessor 也可以是 lambda：

source: A daily session refers to a day in which your app was used.
zh_cn: daily session 是指你的应用使用的日期。

source: A Barrier references multiple widgets as input, and creates a virtual guideline based on the most extreme widget on the specified side.
zh_cn: 屏障引用多个小部件作为输入，并基于指定侧的最极端小部件创建虚拟参考线。

source: A Behavior implements one or more interactions that a user can take on a child view.
zh_cn: 行为实现用户可以对子 view 进行的一个或多个交互。

source: A ChipGroup is used to hold multiple Chips.
zh_cn: ChipGroup 用于保存多个 Chip。

source: A CircularRevealWidget wrapper for CoordinatorLayout.
zh_cn: CoordinatorLayout 的 CircularRevealWidget 包装器。

source: A CircularRevealWidget wrapper for FrameLayout.
zh_cn: FrameLayout 的 CircularRevealWidget 包装器。

source: A CircularRevealWidget wrapper for GridLayout.
zh_cn: GridLayout 的 CircularRevealWidget 包装器。

source: A CircularRevealWidget wrapper for LinearLayout.
zh_cn: LinearLayout 的 CircularRevealWidget 包装器。

source: A CircularRevealWidget wrapper for MaterialCardView.
zh_cn: MaterialCardView 的 CircularRevealWidget 包装器。

source: A CircularRevealWidget wrapper for RelativeLayout.
zh_cn: RelativeLayout 的 CircularRevealWidget 包装器。

source: A Custom View Example
zh_cn: 一个自定义的 view 的示例

source: A FAB is anchored to BottomAppBar by calling setAnchorId(int), or by setting app:layout_anchor on the FAB in xml.
zh_cn: 通过调用 setAnchorId(int) 或通过在 xml 中的 FAB 上设置 app:layout_anchor，可以将 FAB 锚定到 BottomAppBar。

source: A FileProvider can only generate a content URI for files in directories that you specify beforehand.
zh_cn: FileProvider 只能为预先指定的目录中的文件生成 content URI。

source: A FrameLayout with a rounded corner background and shadow.
zh_cn: 带有圆角背景和阴影的 FrameLayout。

source: A GLSurfaceView provides the following features:
zh_cn: GLSurfaceView 提供以下功能：

source: A Guideline can be either horizontal or vertical:
zh_cn: 一条 Guideline 可以是水平的或垂直的：

source: A HorizontalScrollView is a FrameLayout, meaning you should place one child in it containing the entire contents to scroll; this child may itself be a layout manager with a complex hierarchy of objects.
zh_cn: Horizo​​ntalScrollView 是 FrameLayout，这意味着你应该在其中放置一个包含要滚动的全部内容的子项；这个子本身可能是一个具有复杂对象层次结构的布局管理器。

source: A Layout that arranges its children in a single column or a single row.
zh_cn: 将其子项排列在单个列或单个行中的布局。

source: A Layout where the positions of the children can be described in relation to each other or to the parent.
zh_cn: 一种布局，其中子元素的位置可以描述为彼此或父元素的相对位置。

source: A LayoutManager that lays out children in a staggered grid formation.
zh_cn: 该 LayoutManager 可以以交错网格的形式布置子 view。

source: A Listener interface that can be attached to a RecylcerView to get notified whenever a ViewHolder is attached to or detached from RecyclerView.
zh_cn: 监听接口，可以附加给 RecylcerView，以在 ViewHolder 添加给 RecyclerView 或移除时获得通知。

source: A MeasureSpec can be in one of three modes:
zh_cn: MeasureSpec 可以为下 3 种模式之一：

source: A MeasureSpec encapsulates the layout requirements passed from parent to child.
zh_cn: MeasureSpec 封装了从父级传递给子级的布局要求。

source: A MultiChoiceModeListener receives events for AbsListView#CHOICE_MODE_MULTIPLE_MODAL.
zh_cn: MultiChoiceModeListener 接收 AbsListView#CHOICE_MODE_MULTIPLE_MODAL 的事件。

source: A NestedScrollingParent returning something other than SCROLL_AXIS_NONE is currently acting as a nested scrolling parent for one or more descendant views in the hierarchy.
zh_cn: 如果 NestedScrollingParent 返回 SCROLL_AXIS_NONE 以外的值，表示其当前充当层次结构中一个或多个后代 view 的嵌套滚动父级。

source: A NinePatch drawable is a standard PNG image that includes an extra 1-pixel-wide border.
zh_cn: NinePatch drawable 是包含 1 像素宽度的边框的标准 PNG 图片。

source: A PageTransformer is invoked whenever a visible/attached page is scrolled.
zh_cn: PageTransformer 会在一个 visible/attached 的页面滚动时调用。

source: A RatingBar is an extension of SeekBar and ProgressBar that shows a rating in stars.
zh_cn: RatingBar 是 SeekBar 和 ProgressBar 的扩展，显示星级评分。

source: A Recycler is responsible for managing scrapped or detached item views for reuse.
zh_cn: Recycler 负责管理 scrapped（报废、销毁）或 detached（分离）的 item views 时以用于复用。

source: A RecyclerListener can be set on a RecyclerView to receive messages whenever a view is recycled.
zh_cn: RecyclerListener 可以设置给 RecyclerView，当 view 被复用时可以收到消息。

source: A RecyclerListener is used to receive a notification whenever a View is placed inside the RecycleBin's scrap heap.
zh_cn: 每当 View 放置在 RecycleBin 的废料堆内时，RecyclerListener 用于接收通知。

source: A SeekBar is an extension of ProgressBar that adds a draggable thumb.
zh_cn: SeekBar 是 ProgressBar 的扩展，它添加了一个可拖动的 thumb。

source: A Spec defines the horizontal or vertical characteristics of a group of cells.
zh_cn: Spec 定义了一组单元格的水平或垂直特征。

source: A Switch is a two-state toggle switch widget that can select between two options.
zh_cn: Switch 是一个双状态切换开关小部件，可以在两个选项之间进行选择。

source: A TableLayout consists of a number of TableRow objects, each defining a row (actually, you can have other children, which will be explained below).
zh_cn: TableLayout 由许多 TableRow 对象组成，每个对象定义一行(实际上，你可以有其他子对象，下面将对此进行说明)。

source: A TableRow should always be used as a child of a TableLayout.
zh_cn: TableRow 应始终用作 TableLayout 的子级。

source: A TextSwitcher is useful to animate a label on screen.
zh_cn: TextSwitcher 可用于为屏幕上的标签设置动画。

source: A TextureView can be used to display a content stream.
zh_cn: TextureView 可用于显示内容流。

source: A TextureView's SurfaceTexture can be obtained either by invoking getSurfaceTexture() or by using a SurfaceTextureListener.
zh_cn: 可以通过调用 getSurfaceTexture() 或使用 SurfaceTextureListener 来获取 TextureView 的 SurfaceTexture。

source: A Toolbar is a generalization of action bars for use within application layouts.
zh_cn: 工具栏是 action bars 的泛化，可在应用程序布局中使用。

source: A URI path segment.
zh_cn: 一个 URI 路径段。

source: A View occupies a rectangular area on the screen and is responsible for drawing and event handling.
zh_cn: 一个 View 占据了屏幕上的一块矩形区域，并负责绘制和事件处理。
